{
  "Articles": [
    {
      "Title": "Unit Testing EPiServer: Custom Visitor Group Criterion",
      "Filename": "UnitTestingEPiServer1.md",
      "Category": "Development",
      "Published": "2018-09-29",
      "Preview": "I needed to implement a new visitor group criterion for an EPiServer CMS website. As part of this work I was introducing unit testing into the project and wanted to make sure that all of my new classes were unit tested."
    },
    {
      "Title": "Elastic Search: Boosting Exact Matches Over Partial Matches",
      "Filename": "ElasticSearchBoostingExactMatches.md",
      "Category": "Development",
      "Published": "2018-08-31",
      "Preview": "A client wanted both exact and partial matches to be returned on a search page using ElasticSearch, but wanted exact matches to be higher up the results as they are more relevant."
    },
    {
      "Title": "Lego Doctor Who",
      "Filename": "LegoDrWho.md",
      "Category": "Geek Stories",
      "Published": "2016-01-28",
      "Preview": "I haven't owned any Lego in very long time, but every time I walked past the Lego store in the Leeds Trinity Center I was tempted by a number of sets.  The single biggest thing that put me off was the price tag attached to any set that belonged to a different IP.",
      "Carousel": [
        "articles/images/LegoDrWho01.jpg",
        "articles/images/LegoDrWho02.jpg",
        "articles/images/LegoDrWho03.jpg",
        "articles/images/LegoDrWho04.jpg",
        "articles/images/LegoDrWho05.jpg",
        "articles/images/LegoDrWho06.jpg",
        "articles/images/LegoDrWho07.jpg",
        "articles/images/LegoDrWho08.jpg",
        "articles/images/LegoDrWho09.jpg",
        "articles/images/LegoDrWho10.jpg",
        "articles/images/LegoDrWho11.jpg",
        "articles/images/LegoDrWho12.jpg",
        "articles/images/LegoDrWho13.jpg",
        "articles/images/LegoDrWho14.jpg",
        "articles/images/LegoDrWho15.jpg",
        "articles/images/LegoDrWho16.jpg",
        "articles/images/LegoDrWho17.jpg"
      ],
      "PreviewImage": "articles/images/LegoDrWho01.jpg"
    },
    {
      "Title": "Wedding Memories : Our Set List",
      "Filename": "WeddingSetList.md",
      "Category": "The Big Day",
      "Published": "2015-12-28",
      "Preview": "While going to Wedding Fairs, we saw a couple of groups who specialized in background wedding music to be played during the Wedding Breakfast..."
    },
    {
      "Title": "Wedding Memories : Comment Slips",
      "Filename": "WeddingCommentSlips.md",
      "Category": "The Big Day",
      "Published": "2015-12-27",
      "Preview": "For our wedding, we didn't want to get a standard Wedding Guest Book."
    },
    {
      "Title": "Why I Won't Get a PCP Scheme Again",
      "Filename": "NotDoingPCPSchemesAgain.md",
      "Category": "Finance",
      "Published": "2015-08-17",
      "Preview": "My previous car was a 2005 Vauxhall Meriva and at the time of purchasing, I decided that I would essentially drive the car until the point where it would cost me as much to keep the car on the road as it would to buy one.  That turned out to be this year."
    },
    {
      "Title": "Testing Solutions: Faking Communication with a Third Party Service",
      "Filename": "FakingAThirdPartyService.md",
      "Category": "Development",
      "Published": "2015-07-27",
      "Preview": "One of the problems in performing Quality Assurance for a system that communicates with a third party service is that it can be hard to test to an acceptable level of confidence.  As a payroll provider, we have to provide functionality for sending and recieving employee updates from the HMRC to the customer and this functionality is a pain to test."
    },
    {
      "Title": "Ceroc Northern Champs 2015",
      "Filename": "CerocNorthernChamps2015.md",
      "Category": "Dance",
      "Published": "2015-07-13",
      "Preview": "My wife Caroline and I both like to dance very much, in fact it is how we met.  Our chosen dance style is Modern Jive or Ceroc as it's known as both a style and a brand."
    },
    {
      "Title": "How not to use Includes in Lambda Statements",
      "Filename": "Linq3.md",
      "Category": "Development",
      "Published": "2015-06-03",
      "Preview": "I had been looking into performance issues with one of our products and found a number of badly performing Linq to Entities queries."
    },
    {
      "Title": "Meeting The Ferengi",
      "Filename": "DeepSpaceNine.md",
      "Category": "Geek Stories",
      "Published": "2015-06-03",
      "Preview": "Star Trek has long been on of my geek passions and it was something that I shared with my mother from the beginnings of Star Trek The Next Generation.  Of all the Star Trek series, I enjoyed Deep Space Nine the most as I felt that it brought a little more humanity to the series. However of all the characters in the series, it was the Ferengi family that I liked the most. So when I went to the Sheffield Film and Comic Convention in August 2014 and got to meet Armin Shimerman.",
      "PreviewImage": "articles/images/ArminAndMe.jpg"
    },
    {
      "Title": "Why not to use In Memory Collections in LINQ to Entities",
      "Filename": "Linq2.md",
      "Category": "Development",
      "Published": "2015-05-25",
      "Preview": "It is very important to stop and look at the SQL that is generated by these LINQ queries.  In the example I am about to describe, the SQL that was generated was quite excessive."
    },
    {
      "Title": "Selecting Parent and Children in LINQ to Entities",
      "Filename": "Linq1.md",
      "Category": "Development",
      "Published": "2014-07-24",
      "Preview": "I wanted to select one or more parent records along with the collection of child records as a property of the parent record using Linq to Entities."
    },
    {
      "Title": "Wicked : A Covert Tale of Morality",
      "Filename": "Wicked.md",
      "Category": "Theatre",
      "Published": "2014-06-14",
      "Preview": "After having wanted to see Wicked for a very long time, In Christmas 2013 I finally took the plunge and spent £150 on two tickets for my partner and I.  On Wednesday 11th June 2014 the day finally came around for us to see the show on what would turn out to be the official opening night of the tour.",
      "PreviewImage": "articles/images/WickedOzMap.jpg"
    },
    {
      "Title": "Why I Like BDD",
      "Filename": "WhyILikeBDD.md",
      "Category": "Development",
      "Published": "2014-06-12",
      "Preview": "Behaviour Driven Development (BDD) was developed by Dan North and it is a evolution from Test Driven Development (TDD). It is a means of specifying how software will work that uses Ubiquitous Language that is familiar to Developers, Business Analysts and Product Owners. A lot of people have written a lot about what BDD is all about, in this blog I want to talk about why I like BDD and why I think you should use it."
    },
    {
      "Title": "Avenue Q",
      "Filename": "AvenueQ.md",
      "Category": "Theatre",
      "Published": "2014-06-06",
      "PreviewImage": "articles/images/The-cast-of-Avenue-Q-Photo-Credit-Darren-Bell-2.jpg",
      "Preview": "After having listened, sang along to and laughed at the sound track to Avenue Q more than a few times, it was finally time to see the show.."
    },
    {
      "Title": "iPads, Surfaces and Tablets! Oh My!",
      "Filename": "iPadsSurfaceTables.md",
      "Category": "Geek Stories",
      "Published": "2014-05-22",
      "Preview": "At the back end of 2011, I made the leap from having a netbook to entering the tablet market when I bought an iPad 2.  At the time I was  pretty much the only person running around our offices with a tablet.",
      "PreviewImage": "articles/images/ipad2.jpg"
    },
    {
      "Title": "Failing to Identify the Minimum Viable Product",
      "Filename": "MinimumViableProduct.md",
      "Category": "Development",
      "Published": "2014-05-21",
      "Preview": "I once led a software development team through a rather extensive product rewrite from being a windows application to a web application.  As a Lead Software Developer with a idea, but with no product team, I started on a long journey without taking the first crucial step."
    }
  ]
}